#include <iostream>

using namespace std;

int main()
{
	/*
	자료구조란, 자료를 구조화하여 보관하는 방법

	책장에 책을 넣는다
	book name[5] = { [어린왕자] [내일을 위해] [마법천자문] [ ] [먼나라 이웃나라]}

	리스트
	건축 업자 / 지은 집 
	부산, 서울, 뉴욕, 도쿄

	list myHome = (부산)집, (서울)집, (뉴욕)집, (도쿄)집
	포인터를 이용해서 주소로 내가 원하는 자료를 정리함

	큐
	선입 선출 - 먼저 저장한 자료를 먼저 꺼낼 수 있는 형태

	push : 자료 추가
	pop :  자료 제거 (가장 먼저 추가된 자료가 제거)

	키오스크 - 대기 10명 : 큐
	은행 대기표

	스택
	후입 선출 - 나중에 저장한 자료가 먼저 꺼낼 수 있는 형태

	push : 자료추가
	pop  : 자료 제거 (가장 마지막에 추가된 자료가 제거)

	뒤로가기 / 계산기 

	트리 - tree(나무)

	그래프

	*/

	return 0;
}