#include <iostream>

using namespace std;

void main()

{
	// 00000000 00000000 00000000 00000000
	int position = 0; 
	int x = 4; // 00000000 00000100
	int y = 2; // 00000000 00000010

	position = x; // 00000000 00000000 / 00000000 00000100
	              //                   ->
	// 00000000 00000100 / 00000000 00000000
	position = position << 16; // position <<= 16
	position = position | y;

	cout << position << endl;
	//     상위 비트 :x          하위 비트 : y
	// 00000000 00000000 / 00000000 00000000

	//                  x : 4              y : 2 
	//position = 00000000 00000100 / 00000000 00000010
	
	//X(4): 00000000 00000000 00000000 00000100
	//                        ->
	//      00000000 00000100 00000000 00000000
	// shift : >> , <<
	
	position = x; //0
	position <<= 16;
	position += y;  

	position >>= 16; // position = position >> 16

	int x = position >> 16;
	int y = position;
	// 00000000 00000100 / 00000000 00000000
	// 
	// 
	// 
	// 
	// 
	// 00000000 00000100 00000000 00000010

	// 숙제
	// x 값 4와 y 값2로 상위 비트 x 값과 하위 비트 y을 담은 position을 이용하여
	// position에서 x값 4와 y값 2를 꺼내서 cout으로 출력

	/*                 x                 y
	position : 00000000 00000100 00000000 00000010
	*/
	
	
	
	int x = position >> 16; //00000000 00000000 00000000 00000100
							//

			         // pos : 00000000 00000100 00000000 00000010
	y = position << 16;// y : 00000000 00000010 00000000 00000000
	y = y >> 16;       // y : 00000000 00000000 00000000 00000010 : 2

	//pos : 00000000 00000100 00000000 0000010
	// << 




	

}