/*
C++ 기초 문법
반복문 / 선언문 / 클래스 / switch / 구조체 / 동적할당 / 
if문 / for / while / 파일 입출력 / 문자열 / 자료형 / 포인터 
/ 배열 / rand

/*
숙제 
복습하기~
*/

/*
넥슨 / 정올 : 기초 문법 + 자료구조 + 알고리즘

자료구조 : 여러 자료형을 관리하는 방법
자료구조
- 배열
- 리스트 : 링크드 리스트 / 더블 링크드 리스트
- 스택 : 
- 큐 : 원형큐 / 데큐 / 큐
- 트리 : 이진트리 / 이진 탐색 트리 / 레드 블랙 트리 / AVL 트리
- 해쉬맵

알고리즘 - 문제 해결 방법
정렬 알고리즘
삽입 정렬
선택 정렬
버블 정렬
퀵 정렬
합병 정렬

+

정올 / 백준 / 

- 정렬 : 느려요.

네비게이션

int num[10];

C++ 중급 문법 / 고급 문법 - 몰라도 됨

*/

/*
문자열 복습
1. char szText1[30] = "안녕하세요."
   char szText2[30] = "반갑습니다."
   char szResult[30] = "안녕하세요.";

   szText1를 szResult에 복사
*/

/*
char szTemp[3] = "안\0";
한글 2byte  
영어 1byte

szTemp[0] = 92
szTemp[1] = 3

for(size_t i = 0; i < 30; i++)
{
	szResult[i] = szText1[i];
	cout << szResult[i];
}



*/