#include <iostream>

using namespace std;

void main()
{
	// 초기식 - int i = 0;
	// 조건식 - i < 10 -
	// 증감식 - i++
	/*for (int i = 0; i < 10; i++)
	{

	}*/

	//int a = "aaa"; // int 숫자만 넣어야 됨
	

	/*
	반복문

	while / do while / for
	*/

	/*
	초기식 : int i = 2,f = 1
	조건식 : f < 9 && i < 19 
	증감식 : i += 2, f++
	
	*/

	//for(int i = 2,f = 1; ;)
	//for(초기식; 조건식; 증감식)
	// 초기식 - 변수선언
	// 조건식 - 조건 넣는곳
	// 증감식 - 횟수 증가시키거나 감소시킨다.
	
	// 조건식이 없으면 무한한게 출력된다.
	/*for (;;)
	{
		cout << "반복 실행" << endl;
	}*/

	/*size_t i = 0;
	for (; true; )
	{
		i++;
	}*/

	/*for (int i = 0, int f = 0; i < 10; i++)
	{
		cout << i << "번째 실행" << endl;
	}*/

	/*
	for문 구구단
	2 * 1 = 2
	2 * 2 = 4
	2 * 3 = 6
	...
	2 * 9 = 18
	*/
	for (int i = 1; i <= 9; i++)
	{
		cout << "2 x" << i << "= " << 2 * i << endl;
	}
	/*
	1부터 100까지의 수 중 4와 6의 공배수 
	4의 배수와 6의 배수 값 중 동일한 값들을 의미
	for문을 이용해서 4와 6의 공배수만 출력
	*/
	
	for (int i = 1; i <= 100; i++)
	{
		if (i)
		{

		}
	}
	
	/*
	1. 4와 6의 공배수 만든 코드
	   주석으로 설명 한줄 씩 적어오기

	2. for문으로 1에서 100까지 수 중 짝수만 출력하기
	*/

	/*
	for문 별찍기
	
	
	*/


}