#include <iostream>
using namespace std;

void main()
{
	//for (int i = 0; i < 3; i++) // 10 * 10
	//{
	//	for (int j = 0; j < 3; j++)
	//	{
	//		cout << "i : " << i << ",  " << "j :" << j << endl;
	//	}
	//}

	/*for (int i = 2; i <= 9; i++)
	{

		for (int j = 1; j <= 9; j++)
		{
			cout << i << " * " << j << "= " << i * j << endl;
		}
		cout << endl;
	}*/

	/*
	i * j = i*j i+1 * j = i+1*j i+2 * j = i+2*j
	2 * 1 = 2   2+1 * 1= 2       2+2 * 1 = 2


	2 * 1 = 2  3 * 1 = 3  4 * 1 =4
	2 * 2 = 4  3 * 2 = 6  4 * 2 =8
				.....
	2 * 9 = 18 3 * 9 = 27 4 * 9 =36

	*/

	for (int i = 2; i < 4; i++)
	{
		for (int j = 1; j < 9; j++)
		{
			//i 2 j 1 ~ 8
		}
	}

	// i = 2 j = 1
	//      2      *      1     =         2 2 * 1 = 2 2 * 1 = 2
	//cout << i << " * " << j << "=  " << i * j << "   " << i << " * " << j << "= " << i * j << "   " << i << " * " << j << "= " << i * j << endl;

	/*
	i = 2 j = 9
	*/

	/*
	숙제
	1. 4와 6의 공배수 만든 코드
	   주석으로 설명 한줄 씩 적어오기

	2. 오늘 했던 주석으로 설명 한줄 씩 쓰기

	3.
	5x5 사이즈 별을 출력해라 이중 for문
	*****
	*****
	*****
	*****
	*****

	1. 25개의 별을 가로로 출력한다.
	 - for문을 25번 반복

	2. 별이 다섯개 출력될때마다 개행한다.

	2  > i 멈추기


	2 -> 2 ->9번 반복
	*/

	/*for (int i = 2; i <= 10; i+= 3)
	{
		cout << "반복 실행" << endl;
	}*/
	/*char text = 'a';
	text += 5;

	cout << text << endl;*/

	/*for (int i = 0; i< 10; ++i)
	{
		cout << "반복 실행" << endl;
	}*/
	

	/* 
	10/28 숙제~!!!
	
	1. 4와 6의 공배수 만든 코드
		- 주석으로 설명 한줄 씩 적어오기
		- 분석해서 다음 수업 때 설명하기
	
	2. 아래 코드 분석해서 한줄씩 주석 쓰고 다음 수업 때 설명하기

	for (int i = 0; i < 10; i++)
	{
		for (int j = 0; j < 10; j++)
		{
			cout << "*";
		}
		cout << endl; // *5개출력 그리고, 개행
	}

	3. 복습~
	*/


}