#include <iostream>
using namespace std;
void main()
{
	/*
	for (size_t i = 0; i < 5; i++)//5번
	{
		for (size_t j = 0; j < i + 1; j++) //5번
		{
			cout << "*"; // 25번
		}
		cout << endl;
	}
	*/

	for (size_t i = 0; i < 5; i++)
	{
		for (size_t j = 0; j < length; j++)
		{
			//공백 출력
		}

		for (size_t j = 0; j < length; j++)
		{
			// 별출력 
		}
		cout << endl;
	}


	/*                 i + 1
	i : 0 j : 1번 호출 0 + 1
	i : 1 j : 2번 호출 1 + 1
	i : 2 j : 3번 호출 2 + 1
	i : 3 j : 4번 호출 3 + 1
	i : 4 j : 5번 호출 4 + 1
	*/
}

/*
*****
*****
*****
*****
*****
1번 모양
*
**
***
****
*****

2번 모양
***** 공백 0번 출력 별 5번 출력
 **** 공백 1번 출력 별 4번 출력
  *** 공백 2번 출력 별 3번 출력
   ** 공백 3번 출력 별 2번 출력
    * 공백 4번 출력 별 1번 출력

다음 주 숙제
3번 모양
*****
****
***
**
*

4번 모양
    *
   **
  ***
 ****
*****


*/

/*
설계도 
*/