#include <iostream>
using namespace std;

int main()
{
	/*

	1. 배열에 들어있는 숫자의 갯수 찾기
	ex) int arr[10] = {1,1,2,2,3,3,3,7,7,10} - 배열에 들어있는 숫자의 갯수 찾기

	2. 배열의 합
	ex) int arr[10] = {1,2,3,4,5,6,7,8,9,10}

	3. 배열의 최대값
	ex) int arr[10] = {1,2,3,4,5,6,7,8,9,10}

	4. 배열의 평균
	ex) int arr[10] = {1,2,3,4,5,6,7,8,9,10}

	평균 구하는 방법
	arr[10] = 1,2,3,4,5,6,7,8,9,10
	1. 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 10 = 55
	2. 55 / 10 = 5

	도현
	1/10 + 2/10 + 3/10 + 4/10 + 5/10 + 6/10 + 7/10 + 8/10 + 9/10 + 10/10
	*/
	
	float sum = 0;
	for (int i = 1; i <= 10; i++)
	{
		sum += i / 10.f;
	}
	cout << sum << endl;
	//0.1 + 0.2 + 0.3 + 0.4 + 0.5 + 0.6 + 0.7 + 0.8 + 0.9 + 1.0 = 1;

	/*
	bool
	char
	float
	int
	*/
	return 0;
}